#if defined(_ncp16_)
#define WIDE
#endif

/* BSC

HSCX

CCR1 0D
MODE 1C
CCR2 32
XCCR 07 
RCCR 07
TIMR E9
MASK 00
XBCH 00
RAH1 00
RAH2 00
CMDR 41
TSAX 2F 03
TSAR 2F 03

ISAC

ADF1 80
MASK 32
MODE 3A
TIMR E9
XAD1 00
XAD2 tei
SAB1 SAB2
XPCR 00
XTCR 70
ADF1 00
MOCR 00
SQXR 20
CMDR 41
*/
#ifdef linux
#define SLOW_IO_BY_JUMPING
#if 0 /* def _ncp_ */
#define REALLY_SLOW_IO
#endif
#endif

#include "f_module.h"
#include "primitives.h"
#include "streams.h"
#include "isdn_12.h"
#include "smallq.h"
#include "isdn_limits.h"
#include "isdn_proto.h"
#include <sys/stream.h>
#include "streamlib.h"
#include <sys/errno.h>
#ifdef SCO
#include <sys/immu.h>
#endif
#include <sys/sysmacros.h>
#include <stddef.h>
#include "loader.h"

#ifdef linux
#include <asm/io.h>
#include <linux/ptrace.h>
#include <linux/sched.h>
#include <linux/interrupt.h>
#include <linux/malloc.h>
#define ByteOut(_where,_what) outb_p(_what,_where)
#define ByteIn(_where) inb_p(_where)
#endif

#if 1
#define CEC(x) do{int i;for(i=0;i<1000;i++) if(!(x)) break; } while(0);
#else
#define CEC(x) if(0)printf("c");
#endif

#define NEW_XMIT 0

#define r __rw.__r
#define w __rw.__w
#define ISAC_R_FIFO_SIZE 32
#define ISAC_W_FIFO_SIZE 32
#define HSCX_R_FIFO_SIZE 32
#define HSCX_W_FIFO_SIZE 32

#define FIFO(x) fifo[0] /* forget the address -- WARNING: side effects of x get lost */

#include "shell.h"

typedef struct _isac {
	union {
		struct {
			volatile Byte fifo[ISAC_R_FIFO_SIZE];
/* 00 */	volatile Byte ISTA,STAR,MODE,TIMR;
/* 04 */	volatile Byte EXIR,RBCL,SAPR,RSTA;
/* 08 */	volatile Byte __f1,RHCR,RBCH,__f3;
/* 0C */	volatile Byte __f4[4];
/* 10 */	volatile Byte SPCR,CIR0,MOR0,CIR1;
/* 14 */	volatile Byte MOR1,C1R,C2R,B1CR;
/* 18 */	volatile Byte B2CR,ADF2,MOSR,SQRR;
		} __r;
		struct {
			volatile Byte fifo[ISAC_W_FIFO_SIZE];
/* 00 */	volatile Byte MASK,CMDR,MODE,TIMR;
/* 04 */	volatile Byte XAD1,XAD2,SAP1,SAP2;
/* 08 */	volatile Byte TEI1,TEI2,__f1,__f2;
/* 0C */	volatile Byte __f3[4];
/* 10 */	volatile Byte SPCR,CIX0,MOX0,CIX1;
/* 14 */	volatile Byte MOX1,C1R,C2R,STCR;
/* 18 */	volatile Byte ADF1,ADF2,MOCR,SQXR;
		} __w;
	} __rw;
} *__isac;

#ifdef WIDE
typedef struct _hscx {
	union {
		struct {
			volatile Byte fifo[HSCX_R_FIFO_SIZE];
/* 00 */	volatile Byte STAR,RSTA,MODE,TIMR;
/* 04 */	volatile Byte XAD1,XAD2,__f1,_f2;
/* 08 */	volatile Byte RAL1,RHCR,RBCL,RBCH;
/* 0C */	volatile Byte CCR0,CCR1,CCR2,CCR3;
/* 10 */	volatile Byte __f3,__f4,__f5,__f6;
/* 14 */	volatile Byte VSTR,__f7,PRE ,__f8;
/* 18 */	volatile Byte GISR,IPC ,ISR0,ISR1;
/* 1C */	volatile Byte PVR ,PIS ,PCR ,__f9;
		} __r;
		struct {
			volatile Byte fifo[HSCX_W_FIFO_SIZE];
/* 00 */	volatile Byte CMDR,__f0,MODE,TIMR;
/* 04 */	volatile Byte XAD1,XAD2,RAH1,RAH2;
/* 08 */	volatile Byte RAL1,RAL2,XBCL,XBCH;
/* 0C */	volatile Byte CCR0,CCR1,CCR2,CCR3;
/* 10 */	volatile Byte TSAX,TSAR,XCCR,RCCR;
/* 14 */	volatile Byte BGR ,RLCR,PRE ,__f8;
/* 18 */	volatile Byte IVA ,IPC ,IMR0,IMR1;
/* 1C */	volatile Byte PVR ,PIM ,PCR ,__f9;
		} __w;
	} __rw;
} *__hscx;
#else
typedef struct _hscx {
	union {
		struct {
			volatile Byte fifo[HSCX_R_FIFO_SIZE];
/* 00 */	volatile Byte ISTA,STAR,MODE,TIMR;
/* 04 */	volatile Byte EXIR,RBCL,_f1,RSTA;
/* 08 */	volatile Byte RAL1,RHCR,__f2,__f3;
/* 0C */	volatile Byte CCR2,RBCH,VSTR,CCR1;
		} __r;
		struct {
			volatile Byte fifo[HSCX_W_FIFO_SIZE];
/* 00 */	volatile Byte MASK,CMDR,MODE,TIMR;
/* 04 */	volatile Byte XAD1,XAD2,RAH1,RAH2;
/* 08 */	volatile Byte RAL1,RAL2,XBCL,BGR;
/* 0C */	volatile Byte CCR2,XBCH,RLCR,CCR1;
/* 10 */	volatile Byte TSAX,TSAR,XCCR,RCCR;
		} __w;
	} __rw;
} *__hscx;
#endif

#define ByteInISAC(_dumb,_what) InISAC((_dumb),offsetof(struct _isac,r._what))
#define ByteOutISAC(_dumb,_what,_data) OutISAC((_dumb),offsetof(struct _isac,w._what), (_data))

#define ByteInHSCX(_dumb,_hcr,_what) InHSCX((_dumb),(_hcr),offsetof(struct _hscx,r._what))
#define ByteOutHSCX(_dumb,_hcr,_what,_data) OutHSCX((_dumb),(_hcr),offsetof(struct _hscx,w._what),(_data))

#ifdef linux
#define SetSPL(x) spl5()
#else
#define SetSPL(x) spl((x))
#endif

#ifdef linux
#ifdef _avm_
#include "avm_io.c"
#endif

#ifdef _bsc_
#include "bsc_io.c"
#endif

#ifdef _ncp16_
#include "ncp16_io.c"
#endif

#ifdef _ncp_
#include "ncp_io.c"
#endif

#ifdef _teles_
#include "teles_io.c"
#endif


#define DUMBTIME 300 /* poll: times per second */

#define xxappxx(a,b) a##b
#define NAME(a,b) xxappxx(a,b) /* isn't C wonderful */
#define xxstrxx(a) #a
#define STRING(a) xxstrxx(a) /* ditto */

